{
  "backend/main.mo": "Motoko canister handling user profiles, settings, messages, and default strings with strict access-control checks for user and admin permissions.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend files, components, and test IDs with high-confidence associations.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the Valentine experience UI.",
  "frontend/index.css": "Tailwind base/theme variables defining OKLCH color tokens and global dark/light styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app orchestrating start flow, ambient background, audio, timeline, flip cards, love meter, and final moment.",
  "frontend/src/components/valentine/AmbientBackground.tsx": "Canvas animation of floating petals and hearts using a particle system with continuous motion and gradients.",
  "frontend/src/components/valentine/AudioController.tsx": "Audio player with gesture-based autoplay, mute toggle, and dynamic music source tied to customization store.",
  "frontend/src/components/valentine/CanisterSyncControls.tsx": "Provides login, logout, save, and load controls for syncing customization data with an Internet Identity canister.",
  "frontend/src/components/valentine/CustomizePanel.tsx": "A side panel for editing names, dates, messages, and music, including reset and cloud sync options.",
  "frontend/src/components/valentine/FinalSurpriseMoment.tsx": "Handles the final proposal moment with buttons, fireworks, and a concluding romantic message sequence.",
  "frontend/src/components/valentine/FireworksAnimation.tsx": "Renders animated fireworks on a fullscreen canvas using particle effects.",
  "frontend/src/components/valentine/FloatingLoveFooter.tsx": "Displays a footer with a love message and a referral link to caffeine.ai.",
  "frontend/src/components/valentine/GlassCard.tsx": "A styled container component that applies a glass-card visual effect.",
  "frontend/src/components/valentine/LandingScreen.tsx": "Intro screen with a heartbeat sound and transition before starting the main experience.",
  "frontend/src/components/valentine/LoveMeter.tsx": "Animated love meter that fills to 100%, then breaks and triggers a confetti effect.",
  "frontend/src/components/valentine/OurStoryTimeline.tsx": "Renders a customizable timeline with notes and optional photos, allowing users to edit text and upload images. Uses scroll-based reveal animations and state from the customization store.",
  "frontend/src/components/valentine/ReasonsFlipCards.tsx": "Displays 12 flip cards that reveal custom messages on click, with one special highlighted card. Messages are sourced from the customization store.",
  "frontend/src/components/valentine/SecretCodeUnlock.tsx": "Provides an input form where users enter an anniversary date to unlock a hidden message. Validates multiple date formats and shows hints on incorrect entries.",
  "frontend/src/components/valentine/SecretHeartEasterEgg.tsx": "Implements a tappable heart button that reveals a secret dialog after five taps. The dialog shows a message and embeds the SecretCodeUnlock component.",
  "frontend/src/components/valentine/ValentinesCountdown.tsx": "Calculates and displays a live countdown to the next Valentine's Day. Updates days, hours, minutes, and seconds every second.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes. Supports authenticated and anonymous actor creation.",
  "frontend/src/hooks/useCanisterUserSettings.ts": "Loads and saves user customization settings to the backend canister, converting dates and parsing custom message formats. Syncs store values with backend data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, stored identities, and AuthClient setup. Exposes identity state and status helpers to consumers.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs a React state value with localStorage, handling load and save with JSON parsing.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and saving the caller's user profile via the backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/useRevealOnScroll.ts": "A React hook using IntersectionObserver to track when an element becomes visible on scroll.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, light/dark palettes, and utility classes including glassmorphism and animations.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/state/customizationDefaults.ts": "Defines the customization state shape and provides default romantic text, timeline entries, and media settings.",
  "frontend/src/state/customizationStore.ts": "Zustand store for user customization with setters, reset, and import/export of config, persisted to local storage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings using CSS variables.",
  "project_state.json": "Project metadata describing the romantic web app’s goals, features, architecture, and required assets."
}